
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 3 to change, 3 to destroy.</code></pre>

* Create
  * module.postgresql.terraform_data.trigger_password_reset
* Update
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_HOST-V14
  * module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0]
* Replace
  * module.postgresql.azurerm_postgresql_flexible_server.pgsql_server
  * module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases[&#34;draftstore&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES_HOST will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://draft-store-aat.vault.azure.net/secrets/service-POSTGRES-HOST/5c759b9351dc4c6491bbba83b785d2f7"
        name                    = "service-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST-V14 will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST-V14" {
        id                      = "https://draft-store-aat.vault.azure.net/secrets/service-POSTGRES-HOST-V14/7d6cadc7d28042c5a537e3cf2ae38e8e"
        name                    = "service-POSTGRES-HOST-V14"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # module.bad-response-codes-alert.azurerm_resource_group_template_deployment.custom_alert[0] will be updated in-place
  ~ resource "azurerm_resource_group_template_deployment" "custom_alert" {
        id                       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/draft-store-service-aat/providers/Microsoft.Resources/deployments/Draft-store-bad-response-codes"
        name                     = "Draft-store-bad-response-codes"
        tags                     = {}
      ~ template_content         = jsonencode(
          ~ {
              ~ parameters     = {
                  ~ actionGroupName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ actionGroupRg            = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertDesc                = {
                      ~ type = "String" -> "string"
                    }
                  ~ alertName                = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsName          = {
                      ~ type = "String" -> "string"
                    }
                  ~ appInsightsQuery         = {
                      ~ type = "String" -> "string"
                    }
                  ~ commonTags               = {
                      ~ type = "String" -> "string"
                    }
                  ~ customEmailSubject       = {
                      ~ type = "String" -> "string"
                    }
                  ~ frequencyInMinutes       = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ location                 = {
                      ~ type = "String" -> "string"
                    }
                  ~ severityLevel            = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ timeWindowInMinutes      = {
                      ~ type         = "String" -> "string"
                        # (1 unchanged attribute hidden)
                    }
                  ~ triggerThreshold         = {
                      ~ type = "String" -> "string"
                    }
                  ~ triggerThresholdOperator = {
                      ~ type          = "String" -> "string"
                        # (2 unchanged attributes hidden)
                    }
                }
                # (4 unchanged attributes hidden)
            }
        )
        # (6 unchanged attributes hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server.pgsql_server must be replaced
-/+ resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      ~ create_mode                   = "Update" -> "Default" # forces replacement
      ~ fqdn                          = "rpe-draft-store-v14-aat.postgres.database.azure.com" -> (known after apply)
      ~ id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-draft-store-v14-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-aat" -> (known after apply)
        name                          = "rpe-draft-store-v14-aat"
      + storage_tier                  = (known after apply)
        tags                          = {
            "application"         = "core"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/draft-store.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#platops-help"
            "environment"         = "staging"
            "managedBy"           = "Software Engineering"
        }
      - zone                          = "2" -> null
        # (14 unchanged attributes hidden)

      ~ high_availability {
          - standby_availability_zone = "1" -> null
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-draft-store-v14-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-aat/configurations/backslash_quote" -> (known after apply)
        name      = "backslash_quote"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-draft-store-v14-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.pg_databases["draftstore"] must be replaced
-/+ resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      ~ charset   = "UTF8" -> "utf8"
      ~ id        = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-draft-store-v14-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-aat/databases/draftstore" -> (known after apply)
        name      = "draftstore"
      ~ server_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpe-draft-store-v14-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/rpe-draft-store-v14-aat" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.postgresql.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 4 to add, 3 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1524,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->